---
kind: other
id: Methods.T:Autodesk.Revit.DB.PanelType
source: html/e0ded33b-789e-5f45-5493-9f9d736f2783.htm
---
# PanelType Methods

Activates the symbol to ensure that its geometry is accessible.